heatTransfer/chtMultiRegionSimpleFoam/coldplateCooler/0.org/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/domain0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 0 -0.5 0 );
    }
    outlet
    {
        type            inletOutlet;
        value           uniform ( 0 0.5 0 );
        inletValue      uniform ( 0 0.5 0 );
    }
    baffleFluidToSolid
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    "wall.*"
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
