heatTransfer/chtMultiRegionSimpleFoam/coldplateCooler/0.org/fluid/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/domain0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.00035;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0035;
    }
    outlet
    {
        type            inletOutlet;
        value           uniform 0.0035;
        inletValue      uniform 0.0035;
    }
    baffleFluidToSolid
    {
        type            epsilonWallFunction;
        value           uniform 0.00035;
    }
    "wall.*"
    {
        type            epsilonWallFunction;
        value           uniform 0.00035;
    }
}


// ************************************************************************* //
