heatTransfer/chtMultiRegionSimpleFoam/coldplateCooler/0.org/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/domain1";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 500;

boundaryField
{
    baffleSolidToFluid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 500;
        kappaMethod     solidThermo;
        Tnbr            T;
    }
    "wall.*"
    {
        type            zeroGradient;
    }
    wallHeatSource
    {
        type            fixedValue;
        value           uniform 500;
    }
}


// ************************************************************************* //
