heatTransfer/chtMultiRegionSimpleFoam/coldplateCooler/0.org/solid/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/domain1";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 8000;

boundaryField
{
    baffleSolidToFluid
    {
        type            calculated;
        value           uniform 8000;
    }
    "wall.*"
    {
        type            calculated;
        value           uniform 8000;
    }
    wallHeatSource
    {
        type            calculated;
        value           uniform 8000;
    }
}


// ************************************************************************* //
