heatTransfer/chtMultiRegionSimpleFoam/coldplateCooler/system/fluid/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
);

regions
(
    // Set cell values
    // Inlet velocity
    boxToCell
    {
	box (0 0.05 0.07) (0.02 0.35 0.08);

        fieldValues
        (
            volVectorFieldValue U (0 -0.5 0)
        );
    }
    //Outlet velocity
    boxToCell
    {
	box (0.28 0.05 0.07) (0.3 0.35 0.08);

        fieldValues
        (
            volVectorFieldValue U (0 0.5 0)
        );
    }
    //Center velocity
    boxToCell
    {
	box (0 0.01 0) (0.3 0.05 0.15);

        fieldValues
        (
            volVectorFieldValue U (0.1 0 0.02)
        );
    }
);

// ************************************************************************* //
