heatTransfer/chtMultiRegionSimpleFoam/coldplateCooler/system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    name v1 (0 0 0)     
    name v2 (50 0 0)
    name v3 (50 10 0)
    name v4 (0 10 0)

    name v5 (0 0 70)
    name v6 (50 0 70)
    name v7 (50 10 70)
    name v8 (0 10 70)
    
    name v9 (0 0 80)
    name v10 (50 0 80)
    name v11 (50 10 80)
    name v12 (0 10 80)
    
    name v13 (0 0 150)
    name v14 (50 0 150)
    name v15 (50 10 150)
    name v16 (0 10 150)
    
    name v17 (50 50 70)
    name v18 (250 50 70)
    name v19 (50 50 80)
    name v20 (250 50 80)
    
    name v21 (250 0 0)
    name v22 (300 0 0)
    name v23 (300 10 0)
    name v24 (250 10 0)
    
    name v25 (250 0 70)
    name v26 (300 0 70)
    name v27 (300 10 70)
    name v28 (250 10 70)
    
    name v29 (250 0 80)
    name v30 (300 0 80)
    name v31 (300 10 80)
    name v32 (250 10 80)
    
    name v33 (250 0 150)
    name v34 (300 0 150)
    name v35 (300 10 150)
    name v36 (250 10 150)
);

blocks
(
    hex (v1 v2 v3 v4 v5 v6 v7 v8) (10 5 10) simpleGrading (1 1 1)
    hex (v5 v6 v7 v8 v9 v10 v11 v12) (10 5 5) simpleGrading (1 1 1)
    hex (v9 v10 v11 v12 v13 v14 v15 v16) (10 5 10) simpleGrading (1 1 1)
    
    hex (v2 v21 v24 v3 v6 v25 v28 v7) (30 5 10) simpleGrading (1 1 1)
    hex (v6 v25 v28 v7 v10 v29 v32 v11) (30 5 5) simpleGrading (1 1 1)
    hex (v10 v29 v32 v11 v14 v33 v36 v15) (30 5 10) simpleGrading (1 1 1)
    
    hex (v7 v28 v18 v17 v11 v32 v20 v19) (30 20 5) simpleGrading (1 1 1)
    
    hex (v21 v22 v23 v24 v25 v26 v27 v28) (10 5 10) simpleGrading (1 1 1)
    hex (v25 v26 v27 v28 v29 v30 v31 v32) (10 5 5) simpleGrading (1 1 1)
    hex (v29 v30 v31 v32 v33 v34 v35 v36) (10 5 10) simpleGrading (1 1 1)
    
  
);

edges
(
);

boundary
(
    wallsAdiabatic
    {
        type wall;
        faces
        (
            (v1 v5 v8 v4)
	    (v5 v9 v12 v8)
	    (v9 v13 v16 v12)
	    
	    (v13 v14 v15 v16)
	    (v15 v14 v33 v36)
	    (v36 v33 v34 v35)
	    
	    (v35 v34 v30 v31)
	    (v31 v30 v26 v27)
	    (v27 v26 v22 v23)
	    
	    (v23 v22 v21 v24)
	    (v24 v21 v2 v3)
	    (v3 v2 v1 v4)
	    
	    (v17 v19 v20 v18)
        );
    }
    
    wallHeatSource
    {
        type wall;
        faces
        (
	  (v1 v2 v6 v5)
	  (v5 v6 v10 v9)
	  (v9 v10 v14 v13)
	  
	  (v2 v21 v25 v6)
	  (v6 v25 v29 v10)
	  (v10 v29 v33 v14)
	  
	  (v21 v22 v26 v25)
	  (v25 v26 v30 v29)
	  (v29 v30 v34 v33)
	);
    }
    

    baffleSolidToFluid
    {
        type mappedWall;
	sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     baffleFluidToSolid;
        faces
        (
	  (v4 v8 v7 v3)
	  (v8 v12 v11 v7)
	  (v12 v16 v15 v11)
	  
	  (v11 v15 v36 v32)
	  (v32 v36 v35 v31)
	  (v32 v31 v27 v28)
	  
	  (v28 v27 v23 v24)
	  (v28 v24 v3 v7)
	  (v18 v28 v7 v17)
	  
	  (v17 v7 v11 v19)
	  (v19 v11 v32 v20)
	  (v20 v32 v28 v18)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
